{
  "_name_or_path": "",
  "architectures": null,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "chunk_size_feed_forward": 0,
  "decoder_sparse_step": 1,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 16,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "initializer_range": 0.02,
  "intermediate_size": 32,
  "is_encoder_decoder": false,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "max_position_embeddings": 32,
  "mlp_only_layers": [],
  "model_type": "qwen3_moe",
  "moe_intermediate_size": 24,
  "norm_topk_prob": false,
  "num_attention_heads": 4,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "num_local_experts": 4,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_router_logits": true,
  "pad_token_id": 0,
  "problem_type": null,
  "return_dict": true,
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "rope_theta": 10000.0,
    "rope_type": "default"
  },
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "transformers_version": "5.12.1",
  "use_cache": false,
  "use_sliding_window": false,
  "vocab_size": 64
}
